["Was there ever a US senator that represented the state of Alabama and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Florida and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Maine and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Montana and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was MIT?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was MIT?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was MIT?", "Was there ever a US senator that represented the state of New York and whose alma mater was MIT?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was MIT?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was MIT?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was MIT?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Texas and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Utah and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Washington and whose alma mater was MIT?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was MIT?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of California and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Florida and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Maine and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of New York and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Texas and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Utah and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Washington and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was University of Chicago?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of California and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Florida and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Maine and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of New York and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Texas and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Washington and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Johns Hopkins University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of California and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Florida and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Maine and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Montana and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of New York and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Texas and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Utah and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Washington and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was University of Pennsylvania?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of California and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Florida and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Maine and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Montana and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of New York and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Texas and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Utah and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Washington and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was California Institute of Technology?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Maine and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of New York and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Washington and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Duke University?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of California and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Florida and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Maine and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of New York and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Texas and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Washington and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Northwestern University?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of California and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Florida and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Texas and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Dartmouth College?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of California and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Florida and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Texas and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Washington and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Brown University?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of California and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Maine and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of New York and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Texas and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Washington and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Vanderbilt University?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of California and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Florida and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Maine and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Michigan and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Minnesota and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Mississippi and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Missouri and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Montana and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Nebraska and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Nevada and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of New Hampshire and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of New Jersey and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of New Mexico and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of New York and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of North Carolina and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of North Dakota and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Ohio and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Oklahoma and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Oregon and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Pennsylvania and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Rhode Island and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of South Carolina and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of South Dakota and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Tennessee and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Texas and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Utah and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Vermont and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Virginia and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Washington and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of West Virginia and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Wisconsin and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Wyoming and whose alma mater was Rice University?", "Was there ever a US senator that represented the state of Alabama and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Alaska and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Arizona and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Arkansas and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of California and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Colorado and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Connecticut and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Delaware and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Florida and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Georgia and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Hawaii and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Idaho and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Illinois and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Indiana and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Iowa and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Kansas and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Kentucky and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Louisiana and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Maine and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Maryland and whose alma mater was University of Washington?", "Was there ever a US senator that represented the state of Massachusetts and whose alma mater was University of Washington?"]
